<html xmlns="http://www.w3.org/1999/xhtml" >

<head>
    <title>Snapper Extension version @@snapper_version@@ - Help</title>
    <link type="text/css" rel="Stylesheet" href="chrome://snapper/content/css/SnapperHelp.css" />
</head>

<body><div id="helpHeader">A Snapper kiterjeszt&eacute;s v&aacute;ltozata: @@snapper_version@@<img id="helpHeaderSnapperLogo" class="snapperLogo" src="chrome://snapper/content/images/snapper_logo.png" alt="Snapper Extension Logo" />
    </div>
    
<div id="helpSectionHowTo">
        <span class="sectionHeader">Hogyan haszn&aacute;ljam a Snapper-t</span><br />
        A Snapper haszn&aacute;lata a weboldalak r&ouml;gz&iacute;t&eacute;s&eacute;hez igen egyszer&#369;:
        <ol>
            <li>V&aacute;lassza ki a weboldalon a r&ouml;gz&iacute;teni k&iacute;v&aacute;nt r&eacute;szt.</li>
            <li>
                Aktiv&aacute;lja a Snapper kiterjeszt&eacute;st az al&aacute;bbiak valamelyik&eacute;vel:
                  <ul>
                    <li>Kattintson a Snapper ikonra az &aacute;llapotsoron</li>
                    <li>H&iacute;vja el&#337; a helyi men&uuml;t az oldalon &eacute;s v&aacute;lassza ki a  "R&ouml;gz&iacute;t&eacute;s ind&iacute;t&aacute;sa" men&uuml;pontot</li>
                    <li>H&iacute;vja el&#337; a Snapper ikon helyi men&uuml;j&eacute;t &eacute;s v&aacute;lassza ki a  "R&ouml;gz&iacute;t&eacute;s ind&iacute;t&aacute;sa" men&uuml;pontot</li>
                </ul>
            </li>
            <li>Kattintson a weboldalra &eacute;s jel&ouml;lje ki a r&ouml;gz&iacute;teni k&iacute;v&aacute;nt r&eacute;szt.</li>
            <li>A kijel&ouml;l&eacute;s befejezt&eacute;vel egy p&aacute;rbesz&eacute;dablak jelenik meg, melyben lehet&#337;s&eacute;ge van a r&ouml;gz&iacute;tett r&eacute;sz ment&eacute;s&eacute;re.</li>
        </ol>
        
<div id="helpNote">
            Megjegyz&eacute;s: A r&ouml;gz&iacute;t&eacute;s sikeres befejez&eacute;se ut&aacute;n a Snapper automatikusan vissza&aacute;ll alaphelyzetbe, hogy a b&ouml;ng&eacute;sz&eacute;st folytathassa.
        </div>
		
<span class="sectionHeader">K&uuml;l&ouml;nb&ouml;z&#337; r&ouml;gz&iacute;t&eacute;si m&oacute;dok</span><br />
        A 2.0 v&aacute;ltozatt&oacute;l kezd&#337;d&#337;en a Snapper lehet&#337;v&eacute; teszi a felhaszn&aacute;l&oacute;nak r&ouml;gz&iacute;teni a k&eacute;peket t&ouml;bb form&aacute;ban is.  A r&ouml;gz&iacute;t&eacute;s m&oacute;dja kiv&aacute;laszthat&oacute; a kiterjeszt&eacute;s be&aacute;ll&iacute;t&aacute;s ablak&aacute;ban, pl. a Snapper ikonra jobb gombbal kattintva az &aacute;llapotsorban &eacute;s a "Be&aacute;ll&iacute;t&aacute;sok..." men&uuml;pont kiv&aacute;laszt&aacute;s&aacute;val.
        <ul>
            <li><u>Egyszer&#369; r&ouml;gz&iacute;t&eacute;s</u> - Ez a Snapper alap&eacute;rtelmezett viselked&eacute;sm&oacute;dja.  Egy k&eacute;p r&ouml;gz&iacute;t&eacute;s&eacute;hez a felhasn&aacute;l&oacute; aktiv&aacute;lja a Snapper kiterjeszt&eacute;st
            - kattint az eg&eacute;rrel &eacute;s kijel&ouml;li a r&ouml;gz&iacute;teni k&iacute;v&aacute;nt ter&uuml;letet.  A kijel&ouml;l&eacute;s ut&aacute;n a Snapper
            m&aacute;solja &eacute;s/vagy elmenti a r&ouml;gz&iacute;tett k&eacute;pet, &eacute;s lehet&#337;v&eacute; teszi a felhaszn&aacute;l&oacute; sz&aacute;m&aacute;ra a visszat&eacute;r&eacute;st a weblap b&ouml;ng&eacute;sz&eacute;s&eacute;hez.</li>
          <li><u>Horgonyos r&ouml;gz&iacute;t&eacute;s</u> - &Uacute;j r&ouml;gz&iacute;t&eacute;si m&oacute;d a 2.0 v&aacute;ltozatt&oacute;l kezd&#337;d&#337;en.  El&#337;sz&ouml;r is, ez a m&oacute;d egyszer&#369; r&ouml;gz&iacute;t&eacute;st tesz lehet&#337;v&eacute; &uacute;gy, mint az el&#337;z&#337; m&oacute;d. A k&uuml;l&ouml;nbs&eacute;g annyi, hogy a r&ouml;gz&iacute;teni k&iacute;v&aacute;nt ter&uuml;let kijel&ouml;l&eacute;se ut&aacute;n a felhaszn&aacute;l&oacute;nak lehet&#337;s&eacute;ge van a kijel&ouml;lt ter&uuml;letet &aacute;thelyezni &eacute;s &aacute;tm&eacute;retezni. A k&iacute;v&aacute;nt m&eacute;ret &eacute;s a helyes poz&iacute;ci&oacute; be&aacute;ll&iacute;t&aacute;sa ut&aacute;n dupla kattint&aacute;ssal fejezhet&#337; be a r&ouml;gz&iacute;t&eacute;s.</li>
  </ul>
        <br />
		<span class="sectionHeader">R&ouml;gz&iacute;tett k&eacute;p m&aacute;sol&aacute;sa a v&aacute;g&oacute;lapra</span><br />
        Egy r&ouml;gz&iacute;tett k&eacute;p m&aacute;sol&aacute;sa a rendszer v&aacute;g&oacute;lapj&aacute;ra csak egy egyszer&#369; m&oacute;dja annak, hogy a k&eacute;pet elmentse egy f&aacute;jlba.
		V&aacute;lassza ki a  Snapper be&aacute;ll&iacute;t&aacute;sok ablakot (jobb kattint&aacute;s a Snapper ikonj&aacute;n, &eacute;s a "Be&aacute;ll&iacute;t&aacute;sok..." men&uuml;pont kiv&aacute;laszt&aacute;sa),
		ahol n&eacute;h&aacute;ny v&aacute;laszt&oacute;gombot tal&aacute;l az al&aacute;bbi opci&oacute;kkal:
        <ul>
            <li><u>M&aacute;sol&aacute;s a v&aacute;g&oacute;lapra</u> - A r&ouml;gz&iacute;tett k&eacute;pet csak m&aacute;solja a v&aacute;g&oacute;lapra (nincs ment&eacute;s)</li>
          <li><u>Ment&eacute;s f&aacute;jlba</u> - A r&ouml;gz&iacute;tett k&eacute;pet csak f&aacute;jlba menti (nincs m&aacute;sol&aacute;s)</li>
            <li><u>M&aacute;sol&aacute;s &eacute;s Ment&eacute;s</u> - A r&ouml;gz&iacute;tett k&eacute;pet m&aacute;solja a v&aacute;g&oacute;lapra *&eacute;s* f&aacute;jlba menti</li>
  </ul>
</div>
    
    <div id="helpFooter">Snapper  @@snapper_version@@ v&aacute;ltozat - @@snapper_name_author@@, @@snapper_date_release_hu-hu@@</div>
    
</body>

</html>
